{
  "elementary": [
    {
      "id": "fe001",
      "front": "What is AI?",
      "back": "AI stands for Artificial Intelligence. It's a computer program that can learn and make decisions, kind of like how you learn from your teachers and parents!",
      "category": "basics"
    },
    {
      "id": "fe002",
      "front": "What is a prompt?",
      "back": "A prompt is a question or instruction you give to AI. It's like raising your hand and asking a question - the better your question, the better answer you'll get!",
      "category": "basics"
    },
    {
      "id": "fe003",
      "front": "Can AI think like humans?",
      "back": "No! AI doesn't really 'think' - it finds patterns in lots of information. It's more like a super-fast pattern finder than a brain.",
      "category": "understanding"
    },
    {
      "id": "fe004",
      "front": "Why should you check AI's answers?",
      "back": "AI can make mistakes! Just like you check your homework, you should always check what AI tells you to make sure it's correct.",
      "category": "safety"
    },
    {
      "id": "fe005",
      "front": "What is ChatGPT?",
      "back": "ChatGPT is a famous AI chatbot made by a company called OpenAI. You can ask it questions and have conversations with it!",
      "category": "tools"
    },
    {
      "id": "fe006",
      "front": "What should you NEVER tell AI?",
      "back": "Never share personal information like your real name, address, phone number, school name, or passwords with AI!",
      "category": "safety"
    },
    {
      "id": "fe007",
      "front": "How does AI learn?",
      "back": "AI learns by looking at LOTS of examples - like millions of books, websites, and pictures. It finds patterns in all that information.",
      "category": "understanding"
    },
    {
      "id": "fe008",
      "front": "What is an AI 'hallucination'?",
      "back": "When AI makes up information that sounds real but isn't true. That's why you should always double-check important facts!",
      "category": "safety"
    },
    {
      "id": "fe009",
      "front": "Can AI create art?",
      "back": "Yes! AI can create pictures, music, and stories. But it learns from human artists, so human creativity is still very important!",
      "category": "capabilities"
    },
    {
      "id": "fe010",
      "front": "Is it okay to copy AI's homework answers?",
      "back": "No! Copying AI's answers is like copying from a classmate - it's not honest. Use AI to help you learn, then do the work yourself!",
      "category": "ethics"
    }
  ],
  "middle": [
    {
      "id": "fm001",
      "front": "What is a Large Language Model (LLM)?",
      "back": "An LLM is an AI trained on massive amounts of text to understand and generate human language. Examples include ChatGPT, Claude, and Gemini.",
      "category": "concepts"
    },
    {
      "id": "fm002",
      "front": "What is machine learning?",
      "back": "Machine learning is a type of AI that learns patterns from data without being explicitly programmed. It improves through experience, like learning from examples.",
      "category": "concepts"
    },
    {
      "id": "fm003",
      "front": "What is AI bias?",
      "back": "AI bias happens when training data contains human biases, causing AI to produce unfair or skewed outputs. It's a real problem AI developers work to fix.",
      "category": "ethics"
    },
    {
      "id": "fm004",
      "front": "What is prompt engineering?",
      "back": "The skill of writing effective prompts to get better AI results. Good prompts are clear, specific, and include context about what you need.",
      "category": "skills"
    },
    {
      "id": "fm005",
      "front": "What does 'temperature' mean in AI?",
      "back": "Temperature controls how random or creative AI responses are. Low temperature = more predictable answers. High temperature = more varied and creative.",
      "category": "technical"
    },
    {
      "id": "fm006",
      "front": "What is generative AI?",
      "back": "AI that creates new content - text, images, music, or code - based on patterns learned from training data. It generates rather than just analyzes.",
      "category": "concepts"
    },
    {
      "id": "fm007",
      "front": "What is Natural Language Processing (NLP)?",
      "back": "Technology that helps computers understand, interpret, and generate human language. It's what makes chatbots able to understand your questions.",
      "category": "technical"
    },
    {
      "id": "fm008",
      "front": "Why is context important in prompts?",
      "back": "Context helps AI understand your situation and needs. Telling AI who you are, what you're working on, and what you need helps it give better responses.",
      "category": "skills"
    },
    {
      "id": "fm009",
      "front": "What is a token in AI?",
      "back": "A token is a unit of text (word or part of a word) that AI processes. Models have limits on how many tokens they can handle in one conversation.",
      "category": "technical"
    },
    {
      "id": "fm010",
      "front": "What is iteration in AI use?",
      "back": "Iteration means refining your prompts based on AI responses. If the first answer isn't right, adjust your prompt and try again until you get what you need.",
      "category": "skills"
    }
  ],
  "highschool": [
    {
      "id": "fh001",
      "front": "What is a transformer architecture?",
      "back": "A neural network design using self-attention mechanisms to process sequential data. Introduced in 2017, it's the foundation of modern LLMs like GPT and Claude.",
      "category": "architecture"
    },
    {
      "id": "fh002",
      "front": "What is fine-tuning?",
      "back": "Taking a pre-trained model and training it further on specific data for a particular task. It adapts general models for specialized applications.",
      "category": "training"
    },
    {
      "id": "fh003",
      "front": "What is RLHF?",
      "back": "Reinforcement Learning from Human Feedback - a training method using human preferences to align AI outputs with desired behavior, making AI more helpful and safe.",
      "category": "training"
    },
    {
      "id": "fh004",
      "front": "What is the context window?",
      "back": "The maximum amount of text (in tokens) an LLM can process in a single interaction. Larger context windows allow longer conversations and documents.",
      "category": "technical"
    },
    {
      "id": "fh005",
      "front": "What is zero-shot vs few-shot learning?",
      "back": "Zero-shot: AI performs tasks without examples. Few-shot: AI learns from a small number of examples in the prompt. Both leverage the model's general knowledge.",
      "category": "concepts"
    },
    {
      "id": "fh006",
      "front": "What is chain-of-thought prompting?",
      "back": "Asking AI to explain its reasoning step-by-step before giving a final answer. This often improves accuracy on complex problems requiring logical thinking.",
      "category": "techniques"
    },
    {
      "id": "fh007",
      "front": "What is an embedding?",
      "back": "A numerical vector representation that captures semantic meaning of data. Words with similar meanings have similar embeddings, enabling AI to understand relationships.",
      "category": "technical"
    },
    {
      "id": "fh008",
      "front": "What is RAG?",
      "back": "Retrieval-Augmented Generation - combining LLMs with external knowledge retrieval. The AI retrieves relevant info before generating, reducing hallucinations.",
      "category": "architecture"
    },
    {
      "id": "fh009",
      "front": "What is prompt injection?",
      "back": "A security attack where malicious instructions in user input override the AI's intended behavior. It's a major security concern for AI applications.",
      "category": "security"
    },
    {
      "id": "fh010",
      "front": "What is multimodal AI?",
      "back": "AI that can process and generate multiple data types - text, images, audio, video. GPT-4 Vision and Gemini are examples of multimodal models.",
      "category": "concepts"
    }
  ],
  "adult": [
    {
      "id": "fa001",
      "front": "What is self-attention in transformers?",
      "back": "A mechanism where each position attends to all positions in a sequence, computing weighted relationships. It enables capturing long-range dependencies efficiently.",
      "category": "architecture"
    },
    {
      "id": "fa002",
      "front": "What is perplexity?",
      "back": "A metric measuring how well a model predicts a sample - the exponential of cross-entropy loss. Lower perplexity indicates better prediction performance.",
      "category": "metrics"
    },
    {
      "id": "fa003",
      "front": "What is LoRA?",
      "back": "Low-Rank Adaptation - an efficient fine-tuning method that trains small rank-decomposition matrices instead of full model weights, dramatically reducing parameters.",
      "category": "training"
    },
    {
      "id": "fa004",
      "front": "What is knowledge distillation?",
      "back": "Training a smaller 'student' model to mimic a larger 'teacher' model's behavior, often using soft probability distributions to transfer knowledge efficiently.",
      "category": "training"
    },
    {
      "id": "fa005",
      "front": "What is nucleus sampling (top-p)?",
      "back": "A decoding strategy that samples from the smallest set of tokens whose cumulative probability exceeds p, dynamically adjusting vocabulary size for diversity.",
      "category": "inference"
    },
    {
      "id": "fa006",
      "front": "What is the KV cache?",
      "back": "Stored key-value tensors from previous tokens during autoregressive generation, avoiding recomputation and enabling efficient sequential text generation.",
      "category": "inference"
    },
    {
      "id": "fa007",
      "front": "What is Mixture of Experts (MoE)?",
      "back": "An architecture with multiple 'expert' sub-networks and a routing mechanism that activates only relevant experts per input, scaling capacity without proportional compute.",
      "category": "architecture"
    },
    {
      "id": "fa008",
      "front": "What is Direct Preference Optimization (DPO)?",
      "back": "A simpler alternative to RLHF that optimizes directly on preference pairs without training a separate reward model, streamlining the alignment pipeline.",
      "category": "training"
    },
    {
      "id": "fa009",
      "front": "What is mechanistic interpretability?",
      "back": "Research reverse-engineering neural networks to understand how they implement specific computations, identifying circuits and features responsible for capabilities.",
      "category": "research"
    },
    {
      "id": "fa010",
      "front": "What is flash attention?",
      "back": "An IO-aware attention algorithm that minimizes memory reads/writes to HBM by tiling computations, enabling longer sequences and faster training without approximation.",
      "category": "optimization"
    }
  ]
}
